Repository: 84000/data-translation-memory
Catalog: toh324-v3.tmx
Source language: bo
Languages: en

source: ཚིགས་སུ་བཅད་པ་བཞི་པ། དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །
en: The Four Stanzas Homage to the Three Jewels!

source: སྐུར་གྱུར་པ་ནི་ཐམས་ཅད་ལ། །མཚན་མཆོག་སུམ་ཅུ་གཉིས་མངའ་བ། །རྫོགས་པའི་སངས་རྒྱས་གྲགས་ལྡན་པའི། །རྒྱལ་བ་ཀུན་ལ་ཕྱག་འཚལ་ལོ། །རྫོགས་སངས་གང་དུ་བལྟམས་པ་དང་། །གང་དུ་བྱང་ཆུབ་ལ་རེག་དང་། །ཞི་བའི་འཁོར་ལོ་བསྐོར་བ་དང་། །
en: I pay homage to all victorious ones, Those celebrated perfect buddhas, And to their bodies That possess the thirty-two supreme marks.

source: ཟག་མེད་མྱ་ངན་འདས་པ་དང་། །བདེ་གཤེགས་གང་དུ་བཞུགས་པ་དང་། །འཆག་པ་དང་ནི་བཞེངས་པ་དང་། །སེང་གེ་ལྟ་བུར་གཟིམས་པ་ཡི། །གནས་དེ་ལ་ནི་བདག་ཕྱག་འཚལ། །
en: Where the perfect buddhas were born, Where they reached awakening, Where they turned the wheel of peace, Where they passed into parinirvāṇa, free from defilement, Where those sugatas sat, Where they walked and stood, And where they slept like lions— To all those places I bow.

source: སྟེང་དང་འོག་དང་བར་དག་དང་། །ཕྱོགས་དང་ཕྱོགས་མཚམས་རྣམས་སུ་ཡང་། །སྐུ་བཅས་སྐུ་ནི་མེད་པ་ཡི། །མཆོད་རྟེན་ལ་ནི་བདག་ཕྱག་འཚལ། །
en: I also bow to all stūpas, With and without relics, Above, in between, below, And in the cardinal and intermediate directions.

source: རྐང་གཉིས་དམ་པ་ཤར་དང་ནི། །བྱང་གི་ཕྱོགས་ཆར་བཞུགས་པ་ཡི། །རྒྱལ་བ་བསྟེན་དཀའ་ཞེས་བྱ་བ། །དེས་ནི་ཚིགས་བཅད་འདི་གསུངས་སོ། །
en: These stanzas were uttered By the victorious one Difficult to Follow, The best of humans, Who dwells in the northeastern direction.

source: གང་གིས་ཚིགས་བཅད་འདི་བཞི་ཡིས། །དེ་བཞིན་གཤེགས་ལ་སྟོད་བྱེད་པ། །དེ་ནི་ཚེ་རབས་སྟོང་དུ་ཡང་། །ངན་འགྲོར་འགྲོ་བར་མི་འགྱུར་རོ། །
en: Those who praise the tathāgatas With these four stanzas Will not go to the lower realms For a thousand lifetimes.

source: ཚིགས་སུ་བཅད་པ་བཞི་པ་རྫོགས་སོ།།
en: Thus ends “The Four Stanzas.”
